class LanguageList {
  static Map<String, List<String>> languageMessages = 
    // English, Korean, Japanese, Chinese
    {
      // 기본 메시지
      "앱 제목": ["Gallery for Mania", "마니아를 위한 전시장", "マニアのためのギャラリー", "为狂热者的画廊"],
      "설정": ["Settings", "설정", "設定", "设置"],
      "언어 선택": ["Select Language", "언어 선택", "言語選択", "选择语言"],
      "테마 선택": ["Select Theme", "테마 선택", "テーマ選択", "选择主题"],
      "홈": ["Home", "홈", "ホーム", "主页"],
      "로그아웃": ["Log Out", "로그아웃", "ログアウト", "登出"],
      "포인트 상점": ["Point Store", "포인트 상점", "ポイントストア", "积分商店"],
      "갤러리": ["Gallery", "갤러리", "ギャラリー", "画廊"],
      "갤러리가 비어있습니다" : ["Gallery is empty", "갤러리가 비어있습니다", "ギャラリーが空です", "画廊是空的"],
      "나의 보관함": ["My Collection", "나의 보관함", "私のコレクション", "我的收藏"],
      "마이 페이지": ["My Page", "마이 페이지", "マイページ", "我的页面"],


      // 게시글 관련 메시지
      "제목과 내용 입력": ["Enter title and content", "제목과 내용 입력", "タイトルと内容を入力", "输入标题和内容"],
      "제목을 입력하세요": ["Enter the title", "제목을 입력하세요", "タイトルを入力してください", "输入标题"],
      "내용을 입력하세요": ["Enter the content", "내용을 입력하세요", "内容を入力してください", "输入内容"],
      "확인": ["Confirm", "확인", "確認", "确认"],
      "수정": ["Edit", "수정", "編集", "编辑"],
      "삭제": ["Delete", "삭제", "削除", "删除"],
      "저장": ["Save", "저장", "保存", "保存"],
      "갤러리에 추가": ["Add to Gallery", "갤러리에 추가", "ギャラリーに追加", "添加到画廊"],
      "제목과 내용 수정": ["Edit title and content", "제목과 내용 수정", "タイトルと内容を編集", "标题和内容编辑"],
      "갤러리 선택 제한": ["Gallery selection limit", "갤러리 선택 제한", "ギャラリー選択制限", "画廊选择限制"],
      "최대 9개의 전시품만 선택할 수 있습니다.": ["You can only select up to 9 exhibits.", "최대 9개의 전시품만 선택할 수 있습니다.", "最大9つの展示品のみ選択できます。", "您只能选择最多9件展品。"],
      

      // 로그인 관련 메시지
      "로그인 성공": ["Login successful", "로그인 성공", "ログイン成功", "登录成功"],
      "로그인 실패": ["Login failed", "로그인 실패", "ログインに失敗しました。", "登录失败"],
      "로그인": ["Log In", "로그인", "ログイン", "登录"],
      "이메일": ["Email", "이메일", "メール", "电子邮件"],
      "비밀번호": ["Password", "비밀번호", "パスワード", "密码"],
      "이메일을 입력하세요": ["Enter your email", "이메일을 입력하세요", "メールアドレスを入力してください", "输入您的电子邮件"],
      "비밀번호를 입력하세요": ["Enter your password", "비밀번호를 입력하세요", "パスワードを入力してください", "输入您的密码"],
      "마이 페이지로 이동": ["Go to my page", "마이 페이지로 이동", "マイページへ移動", "前往我的页面"],
      "환영합니다.": ["Welcome.", "환영합니다.","ようこそ。", "欢迎。"],
      "로그아웃 되었습니다.": ["You have been logged out.", "로그아웃 되었습니다.", "ログアウトされました。", "您已退出登录。"],

      // 로그아웃 상태에서 출력할 메시지
      "로그인이 필요한 서비스입니다.": ["This service requires login.", "로그인이 필요한 서비스입니다.", "ログインが必要なサービスです。", "此服务需要登录。"],

      // 마이 페이지 내부 메시지
      "보유 포인트": ["Available Points", "보유 포인트", "保有ポイント", "持有积分"],
      "프로필 편집": ["Edit Profile", "프로필 편집", "プロフィール編集", "编辑个人资料"],

      // 포인트 메시지
      "품절" : ["Sold Out", "품절", "完売", "售罄"],
      "구매" : ["Purchase", "구매", "購入", "购买"],
      "취소" : ["Cancel", "취소", "キャンセル", "取消"]
    };

}
